validacao/results/xvwa/modsecurity/06_wrk.log
=== wrk | xvwa/modsecurity | https://172.18.0.8:8443/xvwa/ | 17/07/2026 20:54:04,76 ===
REPETICOES: 1
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" https://172.18.0.8:8443/xvwa/
----------------------------------------------------------------

=== EXECUCAO UNICA ===
Running 30s test @ https://172.18.0.8:8443/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   915.56ms  387.43ms   2.94s    68.45%
    Req/Sec    33.73     22.93   140.00     60.60%
  Latency Distribution
     50%  855.37ms
     75%    1.13s 
     90%    1.46s 
     99%    2.08s 
  11097 requests in 30.10s, 113.22MB read
  Socket errors: connect 0, read 320, write 0, timeout 63
Requests/sec:    368.64
Transfer/sec:      3.76MB
RUN_RC=0

TOOL_RC=0