validacao/results/xvwa/modsecurity/06_wrk.log
=== wrk | xvwa/modsecurity | https://172.18.0.8:8443/xvwa/ | 06/06/2026 18:45:53,68 ===
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency https://172.18.0.8:8443/xvwa/
----------------------------------------------------------------
Running 30s test @ https://172.18.0.8:8443/xvwa/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   820.57ms  508.36ms   5.00s    83.28%
    Req/Sec    39.76     25.95   141.00     66.72%
  Latency Distribution
     50%  656.31ms
     75%    1.08s 
     90%    1.45s 
     99%    2.56s 
  13543 requests in 30.10s, 121.21MB read
  Socket errors: connect 0, read 2686, write 0, timeout 85
Requests/sec:    449.95
Transfer/sec:      4.03MB

TOOL_RC=0